{
  "landing.title": "Adrià Entreserra | Portafoli de Desenvolupador Full Stack",
  "landing.description": "Sóc l'Adrià Entreserra, un desenvolupador Full Stack apassionat per crear solucions web i mòbils intuïtives. Explora els meus projectes desenvolupats amb React, Astro i més.",
  "landing.keywords": "Adrià Entreserra, portafoli, desenvolupador Full Stack, React, React Native, projectes, habilitats, estudis, aplicacions multiplataforma",
  "landing.ogTitle": "Adrià Entreserra | Portafoli de Desenvolupador Full Stack",
  "landing.ogDescription": "Descobreix els projectes i habilitats d'Adrià Entreserra, un desenvolupador Full Stack especialitzat en React, React Native i tecnologies modernes.",

  "nav.projects": "Projectes",
  "nav.skills": "Habilitats",
  "nav.studies": "Estudis",
  "nav.contact": "Contacte",

  "hero.title": "DESENVOLUPADOR FULL STACK",
  "hero.name": "Adrià Entreserra",
  "hero.slide": "LLISCA",

  "about.title": "SOBRE MI",
  "about.description": "Sóc l'Adrià Entreserra, un entusiasta desenvolupador Full-Stack de 24 anys que està finalitzant els estudis DAM. La meva passió per la programació, nascuda amb els videojocs, m'ha portat a especialitzar-me en React i React Native per crear experiències web i mòbils intuïtives. Amb una base en disseny 3D i desenvolupament gràfic, busco aportar solucions creatives i eficients en la meva primera oportunitat professional.",

  "projects.title": "PROJECTES",
  "projects.viewWeb": "Veure Projecte",
  "projects.viewOnGitHub": "Veure a GitHub",
  "projects.viewLive": "Veure en Viu",
  "projects.stackTitle": "Tecnologies",
  "projects.challengeTitle": "Reptes",
  "projects.learnTitle": "Aprenentatges",

  "eppets.title": "Eppets - Gestió de Mascotes Exòtiques",
  "eppets.description": "App integral per a la cura de mascotes exòtiques amb seguiment de pes, recordatoris, historial clínic, wiki de coneixement i comunitat d'esdeveniments. Projecte final de grau.",

  "inkpal.title": "InkPal - Gestió de Lectures",
  "inkpal.description": "App de gestió de lectures amb recomanacions IA, comunitat de lectura grupal, seguiment avançat, sistema d'amistats i valoracions de llibres. Deixada per falta de quota d'API.",

  "burnlock.title": "BurnLock - Gestor de Contrasenyes Offline",
  "burnlock.description": "Gestor de contrasenyes que no emmagatzema dades en local ni al núvol, funciona completament offline amb sistema de patrons, compartició segura amb autodestrucció i 2FA.",

  "csstyle.title": "CSStyle.me - Generadors CSS",
  "csstyle.description": "Eines visuals per generar codi CSS: box-shadow, filtres, inputs i més. Actualment en funcionament i sent utilitzada per desenvolupadors.",

  "shortmy.title": "ShortMy - Escurçador d'enllaços",
  "shortmy.description": "ShortMy és un web d'escurçament d'enllaços complet concebut com un dels meus primers projectes full-stack. Té totes les funcions com ara registre d'usuaris, estadístiques d'enllaços i generador de codis QR personalitzats.",

  "techs.title": "HABILITATS",

  "studies.title": "ESTUDIS",

  "cifog.years": "2016-2018",
  "cifog.title": "CFGM Assistent al Producte Gràfic Interactiu",
  "cifog.school": "Cifog - Girona",
  "cifog.description": "Base multidisciplinària: edició de vídeo, fotografia, modelatge 3D, programació web, desenvolupament de videojocs i disseny gràfic.",

  "fx.years": "2018-2022",
  "fx.title": "Carrera de Disseny i Art 3D per a Videojocs",
  "fx.school": "Fx Animation - Barcelona",
  "fx.description": "Estudis de carrera en universitat privada de disseny i art 3D per a videojocs utilitzant 3ds MAX, Unity, Unreal Engine, programes d'Adobe, ZBrush i molts més.",

  "florida.years": "2023-Actualitat...",
  "florida.title": "CFGS Desenvolupament d'Aplicacions Multiplataforma",
  "florida.school": "Florida Universitària - València",
  "florida.description": "Actualment cursant els estudis de desenvolupament d'aplicacions multiplataforma per a diferents dispositius/plataformes. Utilitzant llenguatges de programació, bases de dades i frameworks moderns.",

  "footer.title": "Parlem?",
  "footer.description": "Estic buscant la meva primera oportunitat professional. Si el teu equip necessita un desenvolupador Full-Stack apassionat i creatiu, m'encantaria conèixer més sobre el teu projecte.",
  "footer.copy": "© 2025 ByAdri - Full-Stack Developer",

  "projects.eppets.metaTitle": "Projecte Eppets | Gestió de Mascotes per Adrià Entreserra",
  "projects.eppets.metaDescription": "Descobreix Eppets, una app mòbil per a la cura de mascotes exòtiques. Projecte final de grau d'Adrià Entreserra amb React Native i Firebase.",
  "projects.eppets.pageTitle": "Eppets - Gestió Integral de Mascotes",
  "projects.eppets.pageDescription": "Eppets, el meu projecte final de grau, és una aplicació mòbil integral dissenyada per a la cura exhaustiva de tota mena de mascotes, amb un enfocament especial en les necessitats de les exòtiques. Permet als propietaris realitzar un seguiment detallat del pes, gestionar recordatoris veterinaris, mantenir un historial clínic, accedir a una wiki de cures específiques i connectar amb una comunitat per a esdeveniments.",
  "projects.eppets.status": "En Publicació a Google Play...",
  "projects.eppets.description.heading": "Repte: Una Cura Integral i Especialitzada per a Totes les Mascotes",
  "projects.eppets.description.p1": "Vaig identificar una mancança en el mercat d'apps de cura de mascotes: la majoria se centra en gossos i gats, deixant de banda les necessitats particulars de les espècies exòtiques. Eppets va néixer per omplir aquest buit, oferint eines de seguiment i gestió detallades (pes, cites veterinàries, etc.) adaptades a una àmplia varietat d'animals.",
  "projects.eppets.challange1.title": "Autenticació Segura amb JWT Personalitzat",
  "projects.eppets.challange1.description": "Vaig implementar un sistema d'autenticació utilitzant JWT (JSON Web Tokens) per assegurar les comunicacions entre l'aplicació i el servidor. Això garanteix que només els usuaris autenticats puguin accedir a certes funcionalitats de l'aplicació.",
  "projects.eppets.challange2.title": "Gestió Segura d'Imatges de Mascotes amb Firebase Storage i URL Signades",
  "projects.eppets.challange2.description": "Vaig integrar Firebase Storage per permetre als usuaris pujar imatges de les seves mascotes. Per poder garantir la seguretat d'accés i modificació de les imatges, vaig implementar un sistema de signatura d'URL que assegura que només els usuaris autenticats puguin pujar i accedir a les imatges de les seves mascotes.",
  "projects.eppets.challange3.title": "Sistema de Recordatoris Proactius mitjançant Notificacions Push",
  "projects.eppets.challange3.description": "Vaig utilitzar Firebase Cloud Messaging per implementar notificacions push, permetent als usuaris rebre recordatoris de cites veterinàries i altres esdeveniments importants relacionats amb les seves mascotes. Això millora l'experiència de l'usuari en mantenir-lo informat i compromès amb la cura de les seves mascotes.",
  "projects.eppets.challange4.title": "Fomentant el Coneixement i la Comunitat amb Wiki i Esdeveniments",
  "projects.eppets.challange4.description": "Vaig desenvolupar una secció de wiki on els usuaris poden trobar informació sobre la cura de diferents tipus de mascotes exòtiques. A més, vaig implementar una comunitat perquè els usuaris puguin compartir esdeveniments i experiències, fomentant un sentit de comunitat entre els propietaris de mascotes exòtiques.",
  "projects.eppets.learnings": "Aquest projecte va ser clau per consolidar les meves habilitats en desenvolupament mòbil full-stack. Vaig aprofundir en la integració de serveis com Firebase i Turso SQLite, la implementació d'autenticació segura i el disseny d'aplicacions centrades en l'usuari amb React Native. Vaig aprendre a gestionar dades sensibles i a construir una aplicació robusta llesta per al mercat.",

  "projects.burnlock.metaTitle": "Projecte BurnLock | Gestor de Contrasenyes Offline per Adrià",
  "projects.burnlock.metaDescription": "Explora BurnLock, un gestor de contrasenyes offline amb generació local i compartició segura. Desenvolupat per Adrià Entreserra.",
  "projects.burnlock.pageTitle": "BurnLock - Gestor de Contrasenyes Offline",
  "projects.burnlock.pageDescription": "BurnLock és una aplicació mòbil que prioritza la privacitat per a la generació de contrasenyes segures i veritablement aleatòries, operant completament offline i sense emmagatzemar dades sensibles. El seu innovador sistema de compartició de contrasenyes divideix la clau de desbloqueig entre l'usuari i un servidor mínim (que no desa la contrasenya hashejada), permetent una implementació segura de 2FA per a l'accés compartit.",
  "projects.burnlock.status": "En Desenvolupament...",
  "projects.burnlock.description.heading": "Repte: Reinventant la Seguretat i Privacitat en la Gestió de Contrasenyes",
  "projects.burnlock.description.p1": "El desenvolupament de BurnLock va sorgir de la necessitat d'una solució de gestió de contrasenyes que prioritzés la seguretat i la privacitat de l'usuari. A diferència d'altres gestors de contrasenyes, BurnLock no emmagatzema dades en servidors, la qual cosa redueix el risc de filtracions de dades.",
  "projects.burnlock.challange1.title": "Implementació d'Autenticació de Dos Factors (2FA)",
  "projects.burnlock.challange1.description": "Vaig integrar un sistema d'autenticació de dos factors per afegir una capa addicional de seguretat. Això implica que en compartir-se una contrasenya i la seva respectiva clau de desbloqueig, l'usuari creador ha d'acceptar l'accés a aquesta en un termini de 15 minuts.",
  "projects.burnlock.challange2.title": "Generació de Llavors Criptogràfiques a partir de Patrons Gràfics",
  "projects.burnlock.challange2.description": "En iniciar l'app, es demana a l'usuari que faci un dibuix a la pantalla; aquest dibuix es converteix en coordenades, s'aleatoritza i s'usa com a llavor per crear contrasenyes realment aleatòries sense dependre de valors pseudoaleatoris. Si la llavor és robada, l'atacant no podrà obtenir les contrasenyes, ja que aquestes són generades amb variacions de la llavor i aleatoritzades.",
  "projects.burnlock.challange3.title": "Sistema de Compartició de Secrets Dividits per a Transferència Segura",
  "projects.burnlock.challange3.description": "Vaig desenvolupar una funcionalitat que permet als usuaris compartir contrasenyes de forma segura sense exposar la contrasenya en un servidor. L'usuari insereix una contrasenya i clau de desbloqueig; això encripta la contrasenya en local usant 2 claus (usuari i servidor). El servidor emmagatzema una part de la contrasenya, l'usuari una altra; sense una de les dues claus, la contrasenya no pot ser desbloquejada. Això permet que l'usuari pugui compartir la contrasenya amb altres usuaris sense que el servidor tingui accés a la contrasenya completa.",
  "projects.burnlock.challange4.title": "Disseny d'Interfície Enfocada en la Usabilitat per a Tasques de Seguretat",
  "projects.burnlock.challange4.description": "Vaig dissenyar una interfície senzilla d'usar, entrar i crear, permetent a l'usuari desar preconfiguracions per usar en qualsevol moment.",
  "projects.burnlock.learnings": "Amb BurnLock, vaig enfortir els meus coneixements en seguretat, criptografia bàsica i generació d'aleatorietat robusta. Va ser un exercici pràctic en la implementació de 2FA i el disseny d'arquitectures mòbils que minimitzen l'exposició de dades. Aquest projecte em va permetre aplicar React Native i Firebase en un context on la privacitat de l'usuari és primordial.",

  "projects.inkpal.metaTitle": "Projecte InkPal | App de Gestió de Lectures per Adrià",
  "projects.inkpal.metaDescription": "Coneix InkPal, un projecte d'app per a gestió de lectures amb React Native. Un aprenentatge primerenc d'Adrià Entreserra en desenvolupament mòbil.",
  "projects.inkpal.pageTitle": "InkPal - Gestió de Lectures",
  "projects.inkpal.pageDescription": "InkPal va ser un dels meus primers desenvolupaments en React Native, concebut com una app mòbil per organitzar lectures, descobrir llibres i connectar amb altres lectors. Encara que el seu desenvolupament es va discontinuar per limitacions en la quota de l'API de Google Books, el projecte va ser fonamental per al meu aprenentatge primerenc en la creació d'aplicacions mòbils i la integració de serveis externs.",
  "projects.inkpal.status": "Arxivat...",
  "projects.inkpal.description.heading": "La Visió: Innovar en l'Experiència de Gestió de Lectures",
  "projects.inkpal.description.p1": "El desenvolupament d'InkPal va sorgir de la necessitat d'una solució que facilités la gestió de lectures i la connexió entre lectors. Malgrat la seva discontinuació, el projecte va explorar noves formes d'interactuar amb la literatura.",
  "projects.inkpal.challange1.title": "Integració i Gestió de l'API de Google Books",
  "projects.inkpal.challange1.description": "Vaig implementar la integració amb una API de Google Books per permetre als usuaris buscar i descobrir nous títols. Això va implicar gestionar la paginació i la memòria cau de resultats per millorar el rendiment.",
  "projects.inkpal.challange2.title": "Exploració d'un Sistema de Recomanacions amb IA (Conceptual)",
  "projects.inkpal.challange2.description": "Vaig desenvolupar un sistema de recomanacions basat en les lectures anteriors dels usuaris, utilitzant la IA per analitzar patrons de lectura i suggerir nous llibres.",
  "projects.inkpal.challange3.title": "Disseny de Funcionalitats Socials: Compartició i Lectura Grupal",
  "projects.inkpal.challange3.description": "Vaig implementar una funcionalitat que permet als usuaris compartir les seves lectures i opinions amb amics, fomentant la interacció social i el descobriment de nous llibres. A més de la creació de sales de lectura grupals, on els usuaris poden llegir junts, veure quin llibre estan llegint i per quina pàgina van.",
  "projects.inkpal.challange4.title": "Interfície d'Usuari Atractiva",
  "projects.inkpal.challange4.description": "Vaig dissenyar una interfície intuïtiva i atractiva, centrada en l'experiència de l'usuari, que facilita la navegació i la gestió de lectures. L'aplicació incloïa funcionalitats com seguiment de lectures, valoracions de llibres, un sistema d'amistats per connectar amb altres lectors, perfils d'usuari i gamificació.",
  "projects.inkpal.learnings": "InkPal va ser una etapa crucial en el meu desenvolupament: em vaig enfrontar per primera vegada a la integració d'APIs de tercers (i els seus reptes), vaig explorar conceptes de sistemes de recomanació i vaig reforçar la importància d'una UI atractiva. Encara que no va arribar a producció, va establir les bases de les meves habilitats en React Native i Firebase, i em va ensenyar lliçons valuoses sobre la viabilitat de projectes dependents d'APIs externes.",

  "projects.csstyle.metaTitle": "CSStyle.me | Generadors CSS per Adrià Entreserra",
  "projects.csstyle.metaDescription": "CSStyle.me, una eina web amb generadors CSS visuals creada per Adrià Entreserra. Simplifica el teu flux de treball CSS.",
  "projects.csstyle.pageTitle": "CSStyle.me - Generadors CSS per a Desenvolupadors",
  "projects.csstyle.pageDescription": "CSStyle.me és una eina web que vaig desenvolupar per simplificar la vida dels desenvolupadors, permetent generar visualment codi CSS per a elements comuns (box-shadows, filtres, inputs) i convertir classes de Tailwind a CSS estàndard. L'objectiu és agilitzar la creació d'estils personalitzats sense escriure codi CSS manualment.",
  "projects.csstyle.status": "Completat",
  "projects.csstyle.description.heading": "La Meta: Agilitzar la Creació de CSS de Forma Visual",
  "projects.csstyle.description.p1": "El desenvolupament de CSStyle.me va sorgir de la necessitat d'una eina que facilités la creació d'estils CSS de manera visual. Molts desenvolupadors s'enfronten a dificultats en escriure CSS manualment, per la qual cosa CSStyle.me busca simplificar aquest procés.",
  "projects.csstyle.challange1.title": "Desenvolupament d'un Generador Visual de Codi CSS",
  "projects.csstyle.challange1.description": "Vaig implementar un generador de codi CSS que permet als usuaris crear estils de manera visual. Això va implicar dissenyar una interfície intuïtiva i fàcil d'usar, així com gestionar la lògica per convertir les seleccions de l'usuari en codi CSS.",
  "projects.csstyle.challange2.title": "Personalització d'Estils",
  "projects.csstyle.challange2.description": "Vaig desenvolupar funcionalitats que permeten als usuaris personalitzar els seus estils CSS d'acord amb les seves necessitats. Això inclou la possibilitat d'ajustar propietats com colors, mides i efectes de manera visual.",
  "projects.csstyle.challange3.title": "Compatibilitat amb Diferents Navegadors",
  "projects.csstyle.challange3.description": "Vaig assegurar que el codi CSS generat per CSStyle.me sigui compatible amb els principals navegadors. Això va implicar realitzar proves exhaustives i ajustar el codi segons sigui necessari.",
  "projects.csstyle.challange4.title": "Implementació de Desat d'Estils i Previsualització en Temps Real",
  "projects.csstyle.challange4.description": "Vaig implementar una funcionalitat que permet als usuaris desar els seus estils generats i previsualitzar-los en temps real. Això millora l'experiència de l'usuari en permetre-li veure com s'apliquen els estils sense necessitat de recarregar la pàgina.",
  "projects.csstyle.learnings": "A través del desenvolupament de CSStyle.me, he après sobre la generació de codi, investigant CSS més a fons, la importància d'una interfície d'usuari atractiva i la necessitat de simplificar processos complexos. Aquest projecte m'ha permès aplicar els meus coneixements de React, així com explorar noves tecnologies per millorar l'experiència de l'usuari.",

  "projects.shortmy.metaTitle": "Projecte ShortMy | Escurçador d'Enllaços per Adrià",
  "projects.shortmy.metaDescription": "Descobreix ShortMy, un projecte d'escurçador d'enllaços full-stack. Un desenvolupament primerenc d'Adrià Entreserra amb React i Node.js.",
  "projects.shortmy.pageTitle": "ShortMy - Escurçador d'Enllaços Complet",
  "projects.shortmy.pageDescription": "ShortMy va ser un dels meus primers projectes web full-stack, concebut com un escurçador d'enllaços amb funcionalitats completes com ara registre d'usuaris, estadístiques i generació de QRs personalitzats. Encara que actualment arxivat a causa de la gestió de la base de dades, va ser un projecte clau per entendre la interacció frontend-backend i construir una aplicació web des de zero.",
  "projects.shortmy.status": "Arxivat...",
  "projects.shortmy.description.heading": "L'Objectiu: Construir un Escurçador d'Enllaços Funcional i Educatiu",
  "projects.shortmy.description.p1": "El desenvolupament de ShortMy va sorgir de la necessitat d'una solució que facilités l'escurçament d'enllaços i la gestió d'URLs. Malgrat estar arxivat, ShortMy continua sent un gran aprenentatge, en ser un dels primers projectes que vaig desenvolupar.",
  "projects.shortmy.challange1.title": "Implementació de Registre d'Usuaris",
  "projects.shortmy.challange1.description": "Vaig desenvolupar un sistema de registre d'usuaris que permet als usuaris accedir a estadístiques detallades dels seus enllaços escurçats. Això inclou la creació d'una base de dades per emmagatzemar la informació de l'usuari i la implementació d'un sistema d'autenticació JWT per protegir les dades.",
  "projects.shortmy.challange2.title": "Generació de Codis QR Personalitzats",
  "projects.shortmy.challange2.description": "Vaig implementar una funcionalitat que permet als usuaris generar codis QR personalitzats per als seus enllaços escurçats, podent afegir el logo al centre. Això facilita la compartició d'enllaços en diferents plataformes i millora l'experiència de l'usuari.",
  "projects.shortmy.challange3.title": "Estadístiques d'Enllaços",
  "projects.shortmy.challange3.description": "Vaig desenvolupar un sistema d'estadístiques que permet als usuaris registrats veure el rendiment dels seus enllaços escurçats.",
  "projects.shortmy.challange4.title": "Interfície d'Usuari Intuïtiva",
  "projects.shortmy.challange4.description": "Vaig dissenyar una interfície intuïtiva i atractiva, centrada en l'experiència de l'usuari, que facilita la navegació i la gestió d'enllaços. L'aplicació incloïa funcionalitats com escurçament d'enllaços, generació de codis QR personalitzats i accés a estadístiques detallades.",
  "projects.shortmy.learnings": "Amb ShortMy, vaig adquirir experiència pràctica en el desenvolupament web full-stack amb React i Node.js. Vaig aprendre sobre la gestió de bases de dades d'usuaris, autenticació JWT, i la implementació de característiques com la generació de codis QR. Va ser un projecte fonamental per assentar els meus coneixements inicials en la creació d'aplicacions web completes."
}