{
  "landing.title": "Adrià Entreserra | Full Stack Developer Portfolio",
  "landing.description": "I'm Adrià Entreserra, a Full Stack developer passionate about creating intuitive web and mobile solutions. Explore my projects developed with React, Astro, and more.",
  "landing.keywords": "Adrià Entreserra, portfolio, Full Stack developer, React, React Native, projects, skills, studies, cross-platform applications",
  "landing.ogTitle": "Adrià Entreserra | Full Stack Developer Portfolio",
  "landing.ogDescription": "Discover the projects of a full stack developer",

  "nav.projects": "Projects",
  "nav.skills": "Skills",
  "nav.studies": "Studies",
  "nav.contact": "Contact",

  "hero.title": "FULL STACK DEVELOPER",
  "hero.name": "Adrià Entreserra",
  "hero.slide": "SLIDE",

  "about.title": "ABOUT ME",
  "about.description": "I'm Adrià Entreserra, a 24-year-old enthusiastic Full-Stack developer completing my studies in Multiplatform Application Development (DAM). My passion for programming, sparked by video games, has led me to specialize in React and React Native to create intuitive web and mobile experiences. With a background in 3D design and graphic development, I aim to contribute creative and efficient solutions in my first professional opportunity.",

  "projects.title": "PROJECTS",
  "projects.viewWeb": "View Project",
  "projects.viewOnGitHub": "View on GitHub",
  "projects.viewLive": "View Live",
  "projects.stackTitle": "Technologies",
  "projects.challengeTitle": "Challenges",
  "projects.learnTitle": "Learnings",

  "eppets.title": "Eppets - Exotic Pet Management",
  "eppets.description": "Comprehensive app for exotic pet care featuring weight tracking, reminders, medical history, a knowledge wiki, and an events community. Final degree project.",

  "inkpal.title": "InkPal - Reading Management",
  "inkpal.description": "Reading management app with AI recommendations, group reading community, advanced tracking, friends system, and book ratings. Discontinued due to API quota limitations.",

  "burnlock.title": "BurnLock - Offline Password Manager",
  "burnlock.description": "Password manager that doesn't store data locally or in the cloud, operates completely offline with a pattern system, secure sharing with self-destruction, and 2FA.",

  "csstyle.title": "CSStyle.me - CSS Generators",
  "csstyle.description": "Visual tools to generate CSS code: box-shadow, filters, inputs, and more. Currently operational and being used by developers.",

  "shortmy.title": "ShortMy - Link Shortener",
  "shortmy.description": "ShortMy is a complete link shortening website conceived as one of my first full-stack projects. It has all the features like user registration, link statistics, and custom QR code generator.",

  "techs.title": "SKILLS",

  "studies.title": "STUDIES",

  "cifog.years": "2016-2018",
  "cifog.title": "Vocational Degree in Interactive Graphic Product Assistance",
  "cifog.school": "Cifog - Girona",
  "cifog.description": "Multidisciplinary foundation: video editing, photography, 3D modeling, web programming, video game development, and graphic design.",

  "fx.years": "2018-2022",
  "fx.title": "Degree in 3D Design and Art for Videogames",
  "fx.school": "Fx Animation - Barcelona",
  "fx.description": "Degree studies at a private university in 3D design and art for video games using 3ds MAX, Unity, Unreal Engine, Adobe programs, ZBrush, and many more.",

  "florida.years": "2023-Present...",
  "florida.title": "Higher Vocational Degree in Multiplatform Application Development",
  "florida.school": "Florida Universitària - Valencia",
  "florida.description": "Currently pursuing studies in multiplatform application development for different devices/platforms. Using modern programming languages, databases, and frameworks.",

  "footer.title": "Let's Talk?",
  "footer.description": "I am looking for my first professional opportunity. If your team needs a passionate and creative Full-Stack developer, I would love to learn more about your project.",
  "footer.copy": "© 2025 ByAdri - Full-Stack Developer",

  "projects.eppets.pageTitle": "Eppets - Comprehensive Pet Management",
  "projects.eppets.pageDescription": "Eppets, my final degree project, is a comprehensive mobile application designed for the exhaustive care of all types of pets, with a special focus on the needs of exotic ones. It allows owners to perform detailed weight tracking, manage veterinary reminders, maintain a clinical history, access a specific care wiki, and connect with a community for events.",
  "projects.eppets.status": "Being published on Google Play...",
  "projects.eppets.description.heading": "Challenge: Comprehensive and Specialized Care for All Pets",
  "projects.eppets.description.p1": "I identified a gap in the pet care app market: most focus on dogs and cats, neglecting the particular needs of exotic species. Eppets was born to fill this void, offering detailed tracking and management tools (weight, veterinary appointments, etc.) adapted to a wide variety of animals.",
  "projects.eppets.challange1.title": "Secure Authentication with Custom JWT",
  "projects.eppets.challange1.description": "I implemented an authentication system using JWT (JSON Web Tokens) to secure communications between the application and the server. This ensures that only authenticated users can access certain application features.",
  "projects.eppets.challange2.title": "Secure Management of Pet Images with Firebase Storage and Signed URLs",
  "projects.eppets.challange2.description": "I integrated Firebase Storage to allow users to upload images of their pets. To ensure secure access and modification of images, I implemented a URL signing system that ensures only authenticated users can upload and access their pets' images.",
  "projects.eppets.challange3.title": "Proactive Reminder System via Push Notifications",
  "projects.eppets.challange3.description": "I used Firebase Cloud Messaging to implement push notifications, allowing users to receive reminders for veterinary appointments and other important events related to their pets. This enhances the user experience by keeping them informed and engaged with their pets' care.",
  "projects.eppets.challange4.title": "Fostering Knowledge and Community with Wiki and Events",
  "projects.eppets.challange4.description": "I developed a wiki section where users can find information on caring for different types of exotic pets. Additionally, I implemented a community for users to share events and experiences, fostering a sense of community among exotic pet owners.",
  "projects.eppets.learnings": "This project was key to consolidating my full-stack mobile development skills. I delved deeper into integrating services like Firebase and Turso SQLite, implementing secure authentication, and designing user-centered applications with React Native. I learned to manage sensitive data and build a robust, market-ready application.",

  "projects.burnlock.pageTitle": "BurnLock - Offline Password Manager",
  "projects.burnlock.pageDescription": "BurnLock is a privacy-first mobile application for generating secure and truly random passwords, operating completely offline and without storing sensitive data. Its innovative password sharing system splits the unlock key between the user and a minimal server (which does not store the hashed password), enabling secure 2FA implementation for shared access.",
  "projects.burnlock.status": "In Development...",
  "projects.burnlock.description.heading": "Challenge: Reinventing Security and Privacy in Password Management",
  "projects.burnlock.description.p1": "The development of BurnLock arose from the need for a password management solution that prioritizes user security and privacy. Unlike other password managers, BurnLock does not store data on servers, reducing the risk of data breaches.",
  "projects.burnlock.challange1.title": "Implementation of Two-Factor Authentication (2FA)",
  "projects.burnlock.challange1.description": "I integrated a two-factor authentication system to add an extra layer of security. This means that when a password and its respective unlock key are shared, the creating user must approve access within 15 minutes.",
  "projects.burnlock.challange2.title": "Generation of Cryptographic Seeds from Graphic Patterns",
  "projects.burnlock.challange2.description": "When the app starts, the user is asked to draw on the screen; this drawing is converted into coordinates, randomized, and used as a seed to create truly random passwords without relying on pseudo-random values. If the seed is stolen, the attacker cannot obtain the passwords, as they are generated with variations of the seed and randomized.",
  "projects.burnlock.challange3.title": "Split Secret Sharing System for Secure Transfer",
  "projects.burnlock.challange3.description": "I developed a feature that allows users to share passwords securely without exposing the password on a server. The user inputs a password and an unlock key, which encrypts the password locally using 2 keys (user and server). The server stores one part of the password, the user another; without both keys, the password cannot be unlocked. This allows the user to share the password with other users without the server having access to the complete password.",
  "projects.burnlock.challange4.title": "Usability-Focused Interface Design for Security Tasks",
  "projects.burnlock.challange4.description": "I designed an easy-to-use interface, enter and create, allowing the user to save presets for use at any time.",
  "projects.burnlock.learnings": "With BurnLock, I strengthened my knowledge in security, basic cryptography, and robust randomness generation. It was a practical exercise in implementing 2FA and designing mobile architectures that minimize data exposure. This project allowed me to apply React Native and Firebase in a context where user privacy is paramount.",

  "projects.inkpal.pageTitle": "InkPal - Reading Management",
  "projects.inkpal.pageDescription": "InkPal was one of my first React Native developments, conceived as a mobile app to organize readings, discover books, and connect with other readers. Although its development was discontinued due to limitations in the Google Books API quota, the project was fundamental to my early learning in creating mobile applications and integrating external services.",
  "projects.inkpal.status": "Archived...",
  "projects.inkpal.description.heading": "The Vision: Innovating the Reading Management Experience",
  "projects.inkpal.description.p1": "The development of InkPal arose from the need for a solution that facilitated reading management and connection among readers. Despite its discontinuation, the project explored new ways to interact with literature.",
  "projects.inkpal.challange1.title": "Integration and Management of the Google Books API",
  "projects.inkpal.challange1.description": "I implemented integration with a Google Books API to allow users to search and discover new titles. This involved handling pagination and caching results to improve performance.",
  "projects.inkpal.challange2.title": "Exploration of an AI Recommendation System (Conceptual)",
  "projects.inkpal.challange2.description": "I developed a recommendation system based on users' past readings, using AI to analyze reading patterns and suggest new books.",
  "projects.inkpal.challange3.title": "Design of Social Features: Sharing and Group Reading",
  "projects.inkpal.challange3.description": "I implemented a feature allowing users to share their readings and opinions with friends, fostering social interaction and the discovery of new books. Additionally, the creation of group reading rooms, where users can read together, see which book they are reading, and what page they are on.",
  "projects.inkpal.challange4.title": "Attractive User Interface",
  "projects.inkpal.challange4.description": "I designed an intuitive and attractive user-centric interface that facilitates navigation and reading management. The application included features such as reading tracking, book ratings, a friends system to connect with other readers, user profiles, and gamification.",
  "projects.inkpal.learnings": "InkPal was a crucial stage in my development: I first faced the integration of third-party APIs (and their challenges), explored concepts of recommendation systems, and reinforced the importance of an attractive UI. Although it didn't reach production, it laid the foundation for my React Native and Firebase skills, and taught me valuable lessons about the viability of projects dependent on external APIs.",

  "projects.csstyle.pageTitle": "CSStyle.me - CSS Generators for Developers",
  "projects.csstyle.pageDescription": "CSStyle.me is a web tool I developed to simplify developers' lives, allowing visual generation of CSS code for common elements (box-shadows, filters, inputs) and converting Tailwind classes to standard CSS. The goal is to streamline the creation of custom styles without manually writing CSS code.",
  "projects.csstyle.status": "Completed",
  "projects.csstyle.description.heading": "The Goal: Streamlining CSS Creation Visually",
  "projects.csstyle.description.p1": "The development of CSStyle.me arose from the need for a tool that facilitated the visual creation of CSS styles. Many developers face difficulties writing CSS manually, so CSStyle.me aims to simplify this process.",
  "projects.csstyle.challange1.title": "Development of a Visual CSS Code Generator",
  "projects.csstyle.challange1.description": "I implemented a CSS code generator that allows users to create styles visually. This involved designing an intuitive and easy-to-use interface, as well as handling the logic to convert user selections into CSS code.",
  "projects.csstyle.challange2.title": "Style Customization",
  "projects.csstyle.challange2.description": "I developed features that allow users to customize their CSS styles according to their needs. This includes the ability to adjust properties like colors, sizes, and effects visually.",
  "projects.csstyle.challange3.title": "Cross-Browser Compatibility",
  "projects.csstyle.challange3.description": "I ensured that the CSS code generated by CSStyle.me is compatible with major browsers. This involved extensive testing and adjusting the code as needed.",
  "projects.csstyle.challange4.title": "Implementation of Style Saving and Real-Time Preview",
  "projects.csstyle.challange4.description": "I implemented a feature that allows users to save their generated styles and preview them in real-time. This enhances the user experience by allowing them to see how styles are applied without needing to reload the page.",
  "projects.csstyle.learnings": "Through the development of CSStyle.me, I learned about code generation, delved deeper into CSS, the importance of an attractive user interface, and the need to simplify complex processes. This project has allowed me to apply my React knowledge, as well as explore new technologies to improve the user experience.",

  "projects.shortmy.pageTitle": "ShortMy - Complete Link Shortener",
  "projects.shortmy.pageDescription": "ShortMy was one of my first full-stack web projects, conceived as a link shortener with complete functionalities like user registration, statistics, and custom QR generation. Although currently archived due to database management issues, it was a key project for understanding frontend-backend interaction and building a web application from scratch.",
  "projects.shortmy.status": "Archived...",
  "projects.shortmy.description.heading": "The Objective: Building a Functional and Educational Link Shortener",
  "projects.shortmy.description.p1": "The development of ShortMy arose from the need for a solution that facilitated link shortening and URL management. Despite being archived, ShortMy remains a great learning experience, being one of the first projects I developed.",
  "projects.shortmy.challange1.title": "Implementation of User Registration",
  "projects.shortmy.challange1.description": "I developed a user registration system that allows users to access detailed statistics for their shortened links. This includes creating a database to store user information and implementing a JWT authentication system to protect the data.",
  "projects.shortmy.challange2.title": "Generation of Custom QR Codes",
  "projects.shortmy.challange2.description": "I implemented a feature that allows users to generate custom QR codes for their shortened links, with the ability to add a logo in the center. This facilitates sharing links on different platforms and improves the user experience.",
  "projects.shortmy.challange3.title": "Link Statistics",
  "projects.shortmy.challange3.description": "I developed a statistics system that allows registered users to see the performance of their shortened links.",
  "projects.shortmy.challange4.title": "Intuitive User Interface",
  "projects.shortmy.challange4.description": "I designed an intuitive and attractive user-centric interface that facilitates navigation and link management. The application included features such as link shortening, custom QR code generation, and access to detailed statistics.",
  "projects.shortmy.learnings": "With ShortMy, I gained practical experience in full-stack web development with React and Node.js. I learned about user database management, JWT authentication, and implementing features like QR code generation. It was a fundamental project for solidifying my initial knowledge in creating complete web applications."
}