{
  "landing.title": "Adrià Entreserra | Porfolio de Desarrollador Full Stack",
  "landing.description": "Soy Adrià Entreserra, un desarrollador Full Stack apasionado por crear soluciones web y móviles intuitivas. Explora mis proyectos desarrollados con React, Astro, y más.",
  "landing.keywords": "Adrià Entreserra, portfolio, desarrollador Full Stack, React, React Native, proyectos, habilidades, estudios, aplicaciones multiplataforma",
  "landing.ogTitle": "Adrià Entreserra | Porfolio de Desarrollador Full Stack",
  "landing.ogDescription": "Descubre los proyectos y habilidades de Adrià Entreserra, un desarrollador Full Stack especializado en React, React Native y tecnologías modernas.",

  "nav.projects": "Proyectos",
  "nav.skills": "Habilidades",
  "nav.studies": "Estudios",
  "nav.contact": "Contacto",

  "hero.title": "DESARROLLADOR FULL STACK",
  "hero.name": "Adrià Entreserra",
  "hero.slide": "DESLIZA",

  "about.title": "SOBRE MÍ",
  "about.description": "Soy Adrià Entreserra, un entusiasta desarrollador Full-Stack de 24 años finalizando los estudios DAM. Mi pasión por la programación, nacida con los videojuegos, me ha llevado a especializarme en React y React Native para crear experiencias web y móviles intuitivas. Con una base en diseño 3D y desarrollo gráfico, busco aportar soluciones creativas y eficientes en mi primera oportunidad profesional.",

  "projects.title": "PROYECTOS",
  "projects.viewWeb": "Ver Proyecto",
  "projects.viewOnGitHub": "Ver en GitHub",
  "projects.viewLive": "Ver en Vivo",
  "projects.stackTitle": "Tecnologías",
  "projects.challengeTitle": "Desafíos",
  "projects.learnTitle": "Aprendizajes",

  "eppets.title": "Eppets - Gestión de Mascotas Exóticas",
  "eppets.description": "App integral para el cuidado de mascotas exóticas con tracking de peso, recordatorios, historial clínico, wiki de conocimiento y comunidad de eventos. Proyecto final de grado.",

  "inkpal.title": "InkPal - Gestión de Lecturas",
  "inkpal.description": "App de gestión de lecturas con recomendaciones IA, comunidad de lectura grupal, tracking avanzado, sistema de amistades y valoraciones de libros. Dejada por falta de cuota de API.",

  "burnlock.title": "BurnLock - Gestor de Contraseñas Offline",
  "burnlock.description": "Gestor de contraseñas que no almacena datos en local ni nube, funciona completamente offline con sistema de patrones, compartición segura con autodestrucción y 2FA.",

  "csstyle.title": "CSStyle.me - Generadores CSS",
  "csstyle.description": "Herramientas visuales para generar código CSS: box-shadow, filtros, inputs y más. Actualmente en funcionamiento y siendo utilizada por desarrolladores.",

  "shortmy.title": "ShortMy - Acortador de enlaces",
  "shortmy.description": "ShortMy es una web de acortamiento de enlaces completa concebido como uno de mis primeros proyectos full-stack. Tiene todas las funciones como registro de usuarios, estadísticas de enlaces y generador de códigos QR personalizados.",

  "techs.title": "HABILIDADES",

  "studies.title": "ESTUDIOS",

  "cifog.years": "2016-2018",
  "cifog.title": "CFGM Asistente al Producto Gráfico Interactivo",
  "cifog.school": "Cifog - Girona",
  "cifog.description": "Base multidisciplinar: edición de vídeo, fotografía, modelado 3D, programación web, desarrollo de videojuegos y diseño gráfico.",

  "fx.years": "2018-2022",
  "fx.title": "Carrera de Diseño y Arte 3D para Videojuegos",
  "fx.school": "Fx Animation - Barcelona",
  "fx.description": "Estudios de carrera en universidad privada de diseño y arte 3D para videojuegos utilizando 3ds MAX, Unity, Unreal Engine, programas de Adobe, ZBrush y muchos más.",

  "florida.years": "2023-Actualidad...",
  "florida.title": "CFGS Desarrollo de Aplicaciones Multiplataforma",
  "florida.school": "Florida Universitària - Valencia",
  "florida.description": "Actualmente cursando los estudios de desarrollo de aplicaciones multiplataforma para diferentes dispositivos/plataformas. Utilizando lenguajes de programación, bases de datos y frameworks modernos.",

  "footer.title": "¿Hablamos?",
  "footer.description": "Estoy buscando mi primera oportunidad profesional. Si tu equipo necesita un desarrollador Full-Stack apasionado y creativo, me encantaría conocer más sobre tu proyecto.",
  "footer.copy": "© 2025 ByAdri - Full-Stack Developer",

  "projects.eppets.metaTitle": "Proyecto Eppets | Gestión de Mascotas por Adrià Entreserra",
  "projects.eppets.metaDescription": "Descubre Eppets, una app móvil para el cuidado de mascotas exóticas. Proyecto final de grado de Adrià Entreserra con React Native y Firebase.",
  "projects.eppets.pageTitle": "Eppets - Gestión Integral de Mascotas",
  "projects.eppets.pageDescription": "Eppets, mi proyecto final de grado, es una aplicación móvil integral diseñada para el cuidado exhaustivo de todo tipo de mascotas, con un enfoque especial en las necesidades de las exóticas. Permite a los dueños realizar un seguimiento detallado de peso, gestionar recordatorios veterinarios, mantener un historial clínico, acceder a una wiki de cuidados específicos y conectar con una comunidad para eventos.",
  "projects.eppets.status": "En Publicación en Google Play...",
  "projects.eppets.description.heading": "Desafío: Un Cuidado Integral y Especializado para Todas las Mascotas",
  "projects.eppets.description.p1": "Identifiqué una carencia en el mercado de apps de cuidado de mascotas: la mayoría se centra en perros y gatos, dejando de lado las necesidades particulares de las especies exóticas. Eppets nació para llenar este vacío, ofreciendo herramientas de seguimiento y gestión detalladas (peso, citas veterinarias, etc.) adaptadas a una amplia variedad de animales.",
  "projects.eppets.challange1.title": "Autenticación Segura con JWT Customizado",
  "projects.eppets.challange1.description": "Implementé un sistema de autenticación utilizando JWT (JSON Web Tokens) para asegurar las comunicaciones entre la aplicación y el servidor. Esto garantiza que solo los usuarios autenticados puedan acceder a ciertas funcionalidades de la aplicación.",
  "projects.eppets.challange2.title": "Gestión Segura de Imágenes de Mascotas con Firebase Storage y URLs Firmadas",
  "projects.eppets.challange2.description": "Integré Firebase Storage para permitir a los usuarios subir imágenes de sus mascotas. Para poder garantizar la seguiridad de acceso y modificación de las imágenes, implementé un sistema de firmado de URLs que asegura que solo los usuarios autenticados puedan subir y acceder a las imágenes de sus mascotas.",
  "projects.eppets.challange3.title": "Sistema de Recordatorios Proactivos mediante Notificaciones Push",
  "projects.eppets.challange3.description": "Utilicé Firebase Cloud Messaging para implementar notificaciones push, permitiendo a los usuarios recibir recordatorios de citas veterinarias y otros eventos importantes relacionados con sus mascotas. Esto mejora la experiencia del usuario al mantenerlo informado y comprometido con el cuidado de sus mascotas.",
  "projects.eppets.challange4.title": "Fomentando el Conocimiento y la Comunidad con Wiki y Eventos",
  "projects.eppets.challange4.description": "Desarrollé una sección de wiki donde los usuarios pueden encontrar información sobre el cuidado de diferentes tipos de mascotas exóticas. Además, implementé una comunidad para que los usuarios puedan compartir eventos y experiencias, fomentando un sentido de comunidad entre los dueños de mascotas exóticas.",
  "projects.eppets.learnings": "Este proyecto fue clave para consolidar mis habilidades en desarrollo móvil full-stack. Profundicé en la integración de servicios como Firebase y Turso SQLite, la implementación de autenticación segura y el diseño de aplicaciones centradas en el usuario con React Native. Aprendí a gestionar datos sensibles y a construir una aplicación robusta lista para el mercado.",

  "projects.burnlock.metaTitle": "Proyecto BurnLock | Gestor de Contraseñas Offline por Adrià",
  "projects.burnlock.metaDescription": "Explora BurnLock, un gestor de contraseñas offline con generación local y compartición segura. Desarrollado por Adrià Entreserra.",
  "projects.burnlock.pageTitle": "BurnLock - Gestor de Contraseñas Offline",
  "projects.burnlock.pageDescription": "BurnLock es una aplicación móvil que prioriza la privacidad para la generación de contraseñas seguras y verdaderamente aleatorias, operando completamente offline y sin almacenar datos sensibles. Su innovador sistema de compartición de contraseñas divide la clave de desbloqueo entre el usuario y un servidor mínimo (que no guarda la contraseña hasheada), permitiendo una implementación segura de 2FA para el acceso compartido.",
  "projects.burnlock.status": "En Desarrollo...",
  "projects.burnlock.description.heading": "Desafío: Reinventando la Seguridad y Privacidad en la Gestión de Contraseñas",
  "projects.burnlock.description.p1": "El desarrollo de BurnLock surgió de la necesidad de una solución de gestión de contraseñas que priorizara la seguridad y la privacidad del usuario. A diferencia de otros gestores de contraseñas, BurnLock no almacena datos en servidores, lo que reduce el riesgo de filtraciones de datos.",
  "projects.burnlock.challange1.title": "Implementación de Autenticación de Dos Factores (2FA)",
  "projects.burnlock.challange1.description": "Integré un sistema de autenticación de dos factores para añadir una capa adicional de seguridad. Esto implica que al compartirse una contraseña y su respectiva clave de desbloqueo, el usuario creador debe aceptar el acceso a la misma en un plazo de 15 minutos.",
  "projects.burnlock.challange2.title": "Generación de Semillas Criptográficas a partir de Patrones Gráficos",
  "projects.burnlock.challange2.description": "Al iniciar la app, se le pide al usuario hacer un dibujo en la pantalla, ese dibujo es convertido en coordenadas, aleatorizado y usado como semilla para crear contraseñas realmente aleatorias sin depender de valores pseudoaleatorios. Si la semilla es robada, el atacante no podrá obtener las contraseñas, ya que estas son generadas con variaciones de la semilla y aleatorizadas.",
  "projects.burnlock.challange3.title": "Sistema de Compartición de Secretos Divididos para Transferencia Segura",
  "projects.burnlock.challange3.description": "Desarrollé una funcionalidad que permite a los usuarios compartir contraseñas de forma segura sin exponer la contraseña en un servidor. El usuario inserta una contraseña y clave de desbloqueo, esto encripta la contraseña en local usando 2 claves (usuario y servidor). El servidor almacena una parte de la contraseña, el usuario otra, sin una de las dos claves, la contraseña no puede ser desbloqueada. Esto permite que el usuario pueda compartir la contraseña con otros usuarios sin que el servidor tenga acceso a la contraseña completa.",
  "projects.burnlock.challange4.title": "Diseño de Interfaz Enfocada en la Usabilidad para Tareas de Seguridad",
  "projects.burnlock.challange4.description": "Diseñé una interfaz simple de usar, entrar y crear, permitiendo al usuario guardar pressets para usar en cualquier momento.",
  "projects.burnlock.learnings": "Con BurnLock, fortalecí mis conocimientos en seguridad, criptografía básica y generación de aleatoriedad robusta. Fue un ejercicio práctico en la implementación de 2FA y el diseño de arquitecturas móviles que minimizan la exposición de datos. Este proyecto me permitió aplicar React Native y Firebase en un contexto donde la privacidad del usuario es primordial.",

  "projects.inkpal.metaTitle": "Proyecto InkPal | App de Gestión de Lecturas por Adrià",
  "projects.inkpal.metaDescription": "Conoce InkPal, un proyecto de app para gestión de lecturas con React Native. Un aprendizaje temprano de Adrià Entreserra en desarrollo móvil.",
  "projects.inkpal.pageTitle": "InkPal - Gestión de Lecturas",
  "projects.inkpal.pageDescription": "InkPal fue uno de mis primeros desarrollos en React Native, concebido como una app móvil para organizar lecturas, descubrir libros y conectar con otros lectores. Aunque su desarrollo se discontinuó por limitaciones en la cuota de la API de Google Books, el proyecto fue fundamental para mi aprendizaje temprano en la creación de aplicaciones móviles y la integración de servicios externos.",
  "projects.inkpal.status": "Archivado...",
  "projects.inkpal.description.heading": "La Visión: Innovar en la Experiencia de Gestión de Lecturas",
  "projects.inkpal.description.p1": "El desarrollo de InkPal surgió de la necesidad de una solución que facilitara la gestión de lecturas y la conexión entre lectores. A pesar de su discontinuación, el proyecto exploró nuevas formas de interactuar con la literatura.",
  "projects.inkpal.challange1.title": "Integración y Gestión de la API de Google Books",
  "projects.inkpal.challange1.description": "Implementé la integración con una API Google Books de libros para permitir a los usuarios buscar y descubrir nuevos títulos. Esto implicó manejar la paginación y la caché de resultados para mejorar el rendimiento.",
  "projects.inkpal.challange2.title": "Exploración de un Sistema de Recomendaciones con IA (Conceptual)",
  "projects.inkpal.challange2.description": "Desarrollé un sistema de recomendaciones basado en las lecturas anteriores de los usuarios, utilizando la IA para analizar patrones de lectura y sugerir nuevos libros.",
  "projects.inkpal.challange3.title": "Diseño de Funcionalidades Sociales: Compartición y Lectura Grupal",
  "projects.inkpal.challange3.description": "Implementé una funcionalidad que permite a los usuarios compartir sus lecturas y opiniones con amigos, fomentando la interacción social y el descubrimiento de nuevos libros. Además, de la creación de salas de lectura grupales, donde los usuarios pueden leer juntos, ver que libro están leyendo y por que página van.",
  "projects.inkpal.challange4.title": "Interfaz de Usuario Atractiva",
  "projects.inkpal.challange4.description": "Diseñé una interfaz intuitiva y atractiva, centrada en la experiencia del usuario, que facilita la navegación y la gestión de lecturas. La aplicación incluía funcionalidades como seguimiento de lecturas, valoraciones de libros, un sistema de amistades para conectar con otros lectores, perfiles de usuario y gamificación.",
  "projects.inkpal.learnings": "InkPal fue una etapa crucial en mi desarrollo: me enfrenté por primera vez a la integración de APIs de terceros (y sus desafíos), exploré conceptos de sistemas de recomendación y reforcé la importancia de una UI atractiva. Aunque no llegó a producción, sentó las bases de mis habilidades en React Native y Firebase, y me enseñó lecciones valiosas sobre la viabilidad de proyectos dependientes de APIs externas.",

  "projects.csstyle.metaTitle": "CSStyle.me | Generadores CSS por Adrià Entreserra",
  "projects.csstyle.metaDescription": "CSStyle.me, una herramienta web con generadores CSS visuales creada por Adrià Entreserra. Simplifica tu flujo de trabajo CSS.",
  "projects.csstyle.pageTitle": "CSStyle.me - Generadores CSS para Desarrolladores",
  "projects.csstyle.pageDescription": "CSStyle.me es una herramienta web que desarrollé para simplificar la vida de los desarrolladores, permitiendo generar visualmente código CSS para elementos comunes (box-shadows, filtros, inputs) y convertir clases de Tailwind a CSS estándar. El objetivo es agilizar la creación de estilos personalizados sin escribir código CSS manualmente.",
  "projects.csstyle.status": "Completado",
  "projects.csstyle.description.heading": "La Meta: Agilizar la Creación de CSS de Forma Visual",
  "projects.csstyle.description.p1": "El desarrollo de CSStyle.me surgió de la necesidad de una herramienta que facilitara la creación de estilos CSS de manera visual. Muchos desarrolladores enfrentan dificultades al escribir CSS manualmente, por lo que CSStyle.me busca simplificar este proceso.",
  "projects.csstyle.challange1.title": "Desarrollo de un Generador Visual de Código CSS",
  "projects.csstyle.challange1.description": "Implementé un generador de código CSS que permite a los usuarios crear estilos de manera visual. Esto implicó diseñar una interfaz intuitiva y fácil de usar, así como manejar la lógica para convertir las selecciones del usuario en código CSS.",
  "projects.csstyle.challange2.title": "Personalización de Estilos",
  "projects.csstyle.challange2.description": "Desarrollé funcionalidades que permiten a los usuarios personalizar sus estilos CSS de acuerdo a sus necesidades. Esto incluye la posibilidad de ajustar propiedades como colores, tamaños y efectos de manera visual.",
  "projects.csstyle.challange3.title": "Compatibilidad con Diferentes Navegadores",
  "projects.csstyle.challange3.description": "Aseguré que el código CSS generado por CSStyle.me sea compatible con los principales navegadores. Esto implicó realizar pruebas exhaustivas y ajustar el código según sea necesario.",
  "projects.csstyle.challange4.title": "Implementación de Guardado de Estilos y Previsualización en Tiempo Real",
  "projects.csstyle.challange4.description": "Implementé una funcionalidad que permite a los usuarios guardar sus estilos generados y previsualizarlos en tiempo real. Esto mejora la experiencia del usuario al permitirle ver cómo se aplican los estilos sin necesidad de recargar la página.",
  "projects.csstyle.learnings": "A través del desarrollo de CSStyle.me, he aprendido sobre la generación de código, investigando CSS más a fondo, la importancia de una interfaz de usuario atractiva y la necesidad de simplificar procesos complejos. Este proyecto me ha permitido aplicar mis conocimientos de React, así como explorar nuevas tecnologías para mejorar la experiencia del usuario.",

  "projects.shortmy.metaTitle": "Proyecto ShortMy | Acortador de Enlaces por Adrià",
  "projects.shortmy.metaDescription": "Descubre ShortMy, un proyecto de acortador de enlaces full-stack. Un desarrollo temprano de Adrià Entreserra con React y Node.js.",
  "projects.shortmy.pageTitle": "ShortMy - Acortador de Enlaces Completo",
  "projects.shortmy.pageDescription": "ShortMy fue uno de mis primeros proyectos web full-stack, concebido como un acortador de enlaces con funcionalidades completas como registro de usuarios, estadísticas y generación de QRs personalizados. Aunque actualmente archivado debido a la gestión de la base de datos, fue un proyecto clave para entender la interacción frontend-backend y construir una aplicación web desde cero.",
  "projects.shortmy.status": "Archivado...",
  "projects.shortmy.description.heading": "El Objetivo: Construir un Acortador de Enlaces Funcional y Educativo",
  "projects.shortmy.description.p1": "El desarrollo de ShortMy surgió de la necesidad de una solución que facilitara el acortamiento de enlaces y la gestión de URLs. A pesar de su archivado, ShortMy sigue siendo un gran aprendizaje, al ser uno de los primeros proyectos que desarrollé.",
  "projects.shortmy.challange1.title": "Implementación de Registro de Usuarios",
  "projects.shortmy.challange1.description": "Desarrollé un sistema de registro de usuarios que permite a los usuarios acceder a estadísticas detalladas de sus enlaces acortados. Esto incluye la creación de una base de datos para almacenar la información del usuario y la implementación de un sistema de autenticación JWT para proteger los datos.",
  "projects.shortmy.challange2.title": "Generación de Códigos QR Personalizados",
  "projects.shortmy.challange2.description": "Implementé una funcionalidad que permite a los usuarios generar códigos QR personalizados para sus enlaces acortados, pudiendo añadir el logo en el centro. Esto facilita la compartición de enlaces en diferentes plataformas y mejora la experiencia del usuario.",
  "projects.shortmy.challange3.title": "Estadísticas de Enlaces",
  "projects.shortmy.challange3.description": "Desarrollé un sistema de estadísticas que permite a los usuarios registrados ver el rendimiento de sus enlaces acortados.",
  "projects.shortmy.challange4.title": "Interfaz de Usuario Intuitiva",
  "projects.shortmy.challange4.description": "Diseñé una interfaz intuitiva y atractiva, centrada en la experiencia del usuario, que facilita la navegación y la gestión de enlaces. La aplicación incluía funcionalidades como acortamiento de enlaces, generación de códigos QR personalizados y acceso a estadísticas detalladas.",
  "projects.shortmy.learnings": "Con ShortMy, adquirí experiencia práctica en el desarrollo web full-stack con React y Node.js. Aprendí sobre la gestión de bases de datos de usuarios, autenticación JWT, y la implementación de características como la generación de códigos QR. Fue un proyecto fundamental para asentar mis conocimientos iniciales en la creación de aplicaciones web completas."
}